// напишите программу, которая принимает на вход число (N) и 
// выдает таблицу квадратов чисел от 1 до N 
// 5 -> 25
// 2 -> 4, 
Console.Clear();
Console.Write("Введите X: ");
int X = int.Parse(Console.ReadLine());

Console.Write("Введите Y: ");
int Y = int.Parse(Console.ReadLine());